In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

In [2]:
s = pd.Series([1,3,5,np.nan,6,8])

In [3]:
dates = pd.date_range('20121011',periods=6)

In [4]:
df = pd.DataFrame(np.random.randn(6,4),index=dates, columns=list('ABCD'))
df2 = pd.DataFrame({'A': 1,
                    'B': pd.Timestamp('20121209'),
                    'C': pd.Series(1,index=list(range(4)), dtype='float32'),
                    'D': np.array([3]*4, dtype= 'int32'),
                    'E': pd.Categorical(["test","train","test","train"]),
                    'F': 'foo'})

In [5]:
df2.describe()

       A  C  D
count  4  4  4
mean   1  1  3
std    0  0  0
min    1  1  3
25%    1  1  3
50%    1  1  3
75%    1  1  3
max    1  1  3

[8 rows x 3 columns]

In [6]:
df2.T

,0,1,2,3
A,1,1,1,1
B,2012-12-09 00:00:00,2012-12-09 00:00:00,2012-12-09 00:00:00,2012-12-09 00:00:00
C,1,1,1,1
D,3,3,3,3
E,test,train,test,train
F,foo,foo,foo,foo

In [7]:
df.sort_index(axis=0,ascending=False)

                   A         B         C         D
2012-10-16  0.311674  0.304745 -0.557879 -0.711589
2012-10-15 -1.748140 -2.356421  1.369883 -0.910872
2012-10-14  0.926252  0.162590 -1.171410 -0.044998
2012-10-13 -0.949771 -0.933680  1.633457  0.757899
2012-10-12  0.329459 -1.856734  0.849606 -0.472203
2012-10-11 -0.280001  0.688982 -0.080654  0.175942

[6 rows x 4 columns]

### sort(columns, axis, ascending, inplace, kind, na_position)

In [8]:
df.sort(columns='B',axis=0,ascending=True,)

                   A         B         C         D
2012-10-15 -1.748140 -2.356421  1.369883 -0.910872
2012-10-12  0.329459 -1.856734  0.849606 -0.472203
2012-10-13 -0.949771 -0.933680  1.633457  0.757899
2012-10-14  0.926252  0.162590 -1.171410 -0.044998
2012-10-16  0.311674  0.304745 -0.557879 -0.711589
2012-10-11 -0.280001  0.688982 -0.080654  0.175942

[6 rows x 4 columns]

In [9]:
df.sort

<bound method DataFrame.sort of                    A         B         C         D
2012-10-11 -0.280001  0.688982 -0.080654  0.175942
2012-10-12  0.329459 -1.856734  0.849606 -0.472203
2012-10-13 -0.949771 -0.933680  1.633457  0.757899
2012-10-14  0.926252  0.162590 -1.171410 -0.044998
2012-10-15 -1.748140 -2.356421  1.369883 -0.910872
2012-10-16  0.311674  0.304745 -0.557879 -0.711589

[6 rows x 4 columns]>

In [10]:
df['B']

2012-10-11    0.688982
2012-10-12   -1.856734
2012-10-13   -0.933680
2012-10-14    0.162590
2012-10-15   -2.356421
2012-10-16    0.304745
Freq: D, Name: B, dtype: float64

In [11]:
df[0:3]

                   A         B         C         D
2012-10-11 -0.280001  0.688982 -0.080654  0.175942
2012-10-12  0.329459 -1.856734  0.849606 -0.472203
2012-10-13 -0.949771 -0.933680  1.633457  0.757899

[3 rows x 4 columns]

In [12]:
df[dates[0]:dates[3]]

                   A         B         C         D
2012-10-11 -0.280001  0.688982 -0.080654  0.175942
2012-10-12  0.329459 -1.856734  0.849606 -0.472203
2012-10-13 -0.949771 -0.933680  1.633457  0.757899
2012-10-14  0.926252  0.162590 -1.171410 -0.044998

[4 rows x 4 columns]

In [13]:
df.loc[dates[0]]

A   -0.280001
B    0.688982
C   -0.080654
D    0.175942
Name: 2012-10-11 00:00:00, dtype: float64

In [14]:
df.loc[:,['A','B']]

                   A         B
2012-10-11 -0.280001  0.688982
2012-10-12  0.329459 -1.856734
2012-10-13 -0.949771 -0.933680
2012-10-14  0.926252  0.162590
2012-10-15 -1.748140 -2.356421
2012-10-16  0.311674  0.304745

[6 rows x 2 columns]

In [15]:
df.iloc[0:3,0:3]

                   A         B         C
2012-10-11 -0.280001  0.688982 -0.080654
2012-10-12  0.329459 -1.856734  0.849606
2012-10-13 -0.949771 -0.933680  1.633457

[3 rows x 3 columns]

In [16]:
df.at[dates[0],'A']

-0.28000104564262634

In [17]:
df.iloc[3:5]

                   A         B         C         D
2012-10-14  0.926252  0.162590 -1.171410 -0.044998
2012-10-15 -1.748140 -2.356421  1.369883 -0.910872

[2 rows x 4 columns]

In [18]:
df[df.A > 0]

                   A         B         C         D
2012-10-12  0.329459 -1.856734  0.849606 -0.472203
2012-10-14  0.926252  0.162590 -1.171410 -0.044998
2012-10-16  0.311674  0.304745 -0.557879 -0.711589

[3 rows x 4 columns]

In [19]:
df[df>0]

                   A         B         C         D
2012-10-11       NaN  0.688982       NaN  0.175942
2012-10-12  0.329459       NaN  0.849606       NaN
2012-10-13       NaN       NaN  1.633457  0.757899
2012-10-14  0.926252  0.162590       NaN       NaN
2012-10-15       NaN       NaN  1.369883       NaN
2012-10-16  0.311674  0.304745       NaN       NaN

[6 rows x 4 columns]

In [20]:
df['E']= ['one','two','three','four','five','six']

In [21]:
df[df.E.isin(['one','two'])]

                   A         B         C         D    E
2012-10-11 -0.280001  0.688982 -0.080654  0.175942  one
2012-10-12  0.329459 -1.856734  0.849606 -0.472203  two

[2 rows x 5 columns]

In [22]:
df.loc[:,'D'] = np.array([5] * len(df))

In [23]:
df

                   A         B         C  D      E
2012-10-11 -0.280001  0.688982 -0.080654  5    one
2012-10-12  0.329459 -1.856734  0.849606  5    two
2012-10-13 -0.949771 -0.933680  1.633457  5  three
2012-10-14  0.926252  0.162590 -1.171410  5   four
2012-10-15 -1.748140 -2.356421  1.369883  5   five
2012-10-16  0.311674  0.304745 -0.557879  5    six

[6 rows x 5 columns]

In [24]:
df

                   A         B         C  D      E
2012-10-11 -0.280001  0.688982 -0.080654  5    one
2012-10-12  0.329459 -1.856734  0.849606  5    two
2012-10-13 -0.949771 -0.933680  1.633457  5  three
2012-10-14  0.926252  0.162590 -1.171410  5   four
2012-10-15 -1.748140 -2.356421  1.369883  5   five
2012-10-16  0.311674  0.304745 -0.557879  5    six

[6 rows x 5 columns]

In [25]:
df1 = df.copy

In [26]:
df1 = df.reindex(index= dates[0:4], columns= list(df.columns) + ['F'])

In [27]:
df1

                   A         B         C  D      E   F
2012-10-11 -0.280001  0.688982 -0.080654  5    one NaN
2012-10-12  0.329459 -1.856734  0.849606  5    two NaN
2012-10-13 -0.949771 -0.933680  1.633457  5  three NaN
2012-10-14  0.926252  0.162590 -1.171410  5   four NaN

[4 rows x 6 columns]

In [28]:
df1.loc[dates[0]:dates[2],'F'] = 11

In [29]:
df1

                   A         B         C  D      E   F
2012-10-11 -0.280001  0.688982 -0.080654  5    one  11
2012-10-12  0.329459 -1.856734  0.849606  5    two  11
2012-10-13 -0.949771 -0.933680  1.633457  5  three  11
2012-10-14  0.926252  0.162590 -1.171410  5   four NaN

[4 rows x 6 columns]

In [30]:
test = df1[:]

### dropna(axis, how, inplace, subset, threshold)

In [31]:
test.dropna(axis=0, how='all',inplace=True,subset=['B','F'])

In [32]:
test

                   A         B         C  D      E   F
2012-10-11 -0.280001  0.688982 -0.080654  5    one  11
2012-10-12  0.329459 -1.856734  0.849606  5    two  11
2012-10-13 -0.949771 -0.933680  1.633457  5  three  11
2012-10-14  0.926252  0.162590 -1.171410  5   four NaN

[4 rows x 6 columns]

In [33]:
df.mean(1)

2012-10-11    1.332082
2012-10-12    1.080583
2012-10-13    1.187501
2012-10-14    1.229358
2012-10-15    0.566331
2012-10-16    1.264635
Freq: D, dtype: float64

In [34]:
df = pd.DataFrame(np.random.randn(10,5))

In [35]:
pieces = [df[:3],df[5:8]]

In [36]:
pd.concat(pieces)

          0         1         2         3         4
0  0.573791  0.444856  0.370537 -0.565213  0.401580
1  0.435726  1.234888  1.665073 -2.008286 -0.370557
2  0.151036  0.072930  1.540224 -1.447098  0.709303
5  0.122903 -2.554574  1.528952  0.163301 -0.664179
6 -0.966511 -1.094782 -0.263844  0.511091 -1.187625
7  0.006235  0.677457 -0.690530 -4.303545  0.055226

[6 rows x 5 columns]

In [37]:
df1 = pd.DataFrame({'A': [1,2,3,4,5], 'B': [2,3,4,5,6]},index=[0,1,2,3,4])

In [38]:
df2 = pd.DataFrame({'A': [1,2,3,4,5], 'B': [10,11,12,14,15]},index= [10,11,12,13,15])

In [39]:
pd.concat([df1,df2],keys=['x','y','z'])

      A   B
x 0   1   2
  1   2   3
  2   3   4
  3   4   5
  4   5   6
y 10  1  10
  11  2  11
  12  3  12
  13  4  14
  15  5  15

[10 rows x 2 columns]

In [40]:
df1 = pd.DataFrame({'A': ['A0','A1','A2','A3'], 'B':['B0','B1','B2','B3'], 
                    'C': ['C0','C1','C2','C3'], 'D':['D0','D1','D2','D3']}, index=[0,1,2,3])
df2 = pd.DataFrame({'A': ['A0','A5','A6','A7'], 'B':['B0','B5','B6','B7'], 
                    'C': ['C0','C5','C6','C7'], 'D':['D0','D5','D6','D7']}, index=[0,5,6,7])
df3 = pd.DataFrame({'A': ['A0','A9','A10','A11'], 'B':['B0','B9','B10','B11'], 
                    'C': ['C0','C9','C10','C11'], 'D':['D0','D9','D10','D11']}, index=[0,9,10,11])

In [41]:
test = pd.concat([df1,df2], keys = ['x','y']).ix['x']

In [42]:
df4 = pd.DataFrame({'B':['B4','B5','B6','B7'],'D':['D2','D3','D4','D5'],
                   'F':['F4','F5','F6','F7']}, index = [2,4,6,7])

In [43]:
pd.concat([df1,df4],axis=0,join='outer')

     A   B    C   D    F
0   A0  B0   C0  D0  NaN
1   A1  B1   C1  D1  NaN
2   A2  B2   C2  D2  NaN
3   A3  B3   C3  D3  NaN
2  NaN  B4  NaN  D2   F4
4  NaN  B5  NaN  D3   F5
6  NaN  B6  NaN  D4   F6
7  NaN  B7  NaN  D5   F7

[8 rows x 5 columns]

In [44]:
pd.concat([df1,df4],axis=0)

     A   B    C   D    F
0   A0  B0   C0  D0  NaN
1   A1  B1   C1  D1  NaN
2   A2  B2   C2  D2  NaN
3   A3  B3   C3  D3  NaN
2  NaN  B4  NaN  D2   F4
4  NaN  B5  NaN  D3   F5
6  NaN  B6  NaN  D4   F6
7  NaN  B7  NaN  D5   F7

[8 rows x 5 columns]

In [45]:
pd.concat([df1,df2],join= 'outer')

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3
0  A0  B0  C0  D0
5  A5  B5  C5  D5
6  A6  B6  C6  D6
7  A7  B7  C7  D7

[8 rows x 4 columns]

In [46]:
pd.concat([df1,df2],join= 'inner')

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3
0  A0  B0  C0  D0
5  A5  B5  C5  D5
6  A6  B6  C6  D6
7  A7  B7  C7  D7

[8 rows x 4 columns]

In [47]:
df1

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

[4 rows x 4 columns]

In [48]:
df2

    A   B   C   D
0  A0  B0  C0  D0
5  A5  B5  C5  D5
6  A6  B6  C6  D6
7  A7  B7  C7  D7

[4 rows x 4 columns]

In [49]:
df3

      A    B    C    D
0    A0   B0   C0   D0
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

[4 rows x 4 columns]

In [61]:
result = pd.concat([df1,df2,df3], join = 'inner', axis = 0, keys = ['x','y','z'])

In [62]:
result

        A    B    C    D
x 0    A0   B0   C0   D0
  1    A1   B1   C1   D1
  2    A2   B2   C2   D2
  3    A3   B3   C3   D3
y 0    A0   B0   C0   D0
  5    A5   B5   C5   D5
  6    A6   B6   C6   D6
  7    A7   B7   C7   D7
z 0    A0   B0   C0   D0
  9    A9   B9   C9   D9
  10  A10  B10  C10  D10
  11  A11  B11  C11  D11

[12 rows x 4 columns]

In [73]:
pd.concat([df1,df4],axis=1, join= 'inner', join_axes= [df3.index])

      A    B    C    D    B    D    F
0    A0   B0   C0   D0  NaN  NaN  NaN
9   NaN  NaN  NaN  NaN  NaN  NaN  NaN
10  NaN  NaN  NaN  NaN  NaN  NaN  NaN
11  NaN  NaN  NaN  NaN  NaN  NaN  NaN

[4 rows x 7 columns]

In [80]:
pd.concat([df1, df3], ignore_index=False, join='inner')

      A    B    C    D
0    A0   B0   C0   D0
1    A1   B1   C1   D1
2    A2   B2   C2   D2
3    A3   B3   C3   D3
0    A0   B0   C0   D0
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

[8 rows x 4 columns]

In [83]:
df1.append(df4,ignore_index=True)

     A   B    C   D    F
0   A0  B0   C0  D0  NaN
1   A1  B1   C1  D1  NaN
2   A2  B2   C2  D2  NaN
3   A3  B3   C3  D3  NaN
4  NaN  B4  NaN  D2   F4
5  NaN  B5  NaN  D3   F5
6  NaN  B6  NaN  D4   F6
7  NaN  B7  NaN  D5   F7

[8 rows x 5 columns]

In [89]:
pd.concat([df1,df4], axis =1 , ignore_index=True, keys = ['x','y','z','a','b','c','d'])

     0    1    2    3    4    5    6
0   A0   B0   C0   D0  NaN  NaN  NaN
1   A1   B1   C1   D1  NaN  NaN  NaN
2   A2   B2   C2   D2   B4   D2   F4
3   A3   B3   C3   D3  NaN  NaN  NaN
4  NaN  NaN  NaN  NaN   B5   D3   F5
6  NaN  NaN  NaN  NaN   B6   D4   F6
7  NaN  NaN  NaN  NaN   B7   D5   F7

[7 rows x 7 columns]

In [90]:
s2 = pd.Series([0,1,2,3], name = 'foo')
s3 = pd.Series([2,3,4,5])
s4 = pd.Series([10,11,12,13])

In [93]:
pd.concat([s2,s3,s4], axis =1, keys = ['x','y','z'] )

   x  y   z
0  0  2  10
1  1  3  11
2  2  4  12
3  3  5  13

[4 rows x 3 columns]

In [94]:
pieces = {'x': df1, 'y': df2, 'z':df3}

In [95]:
pd.concat(pieces, keys = ['z','y'])

        A    B    C    D
z 0    A0   B0   C0   D0
  9    A9   B9   C9   D9
  10  A10  B10  C10  D10
  11  A11  B11  C11  D11
y 0    A0   B0   C0   D0
  5    A5   B5   C5   D5
  6    A6   B6   C6   D6
  7    A7   B7   C7   D7

[8 rows x 4 columns]

In [96]:
pd.concat(pieces, keys = ['z','y']).index.levels

FrozenList([[u'z', u'y'], [0, 5, 6, 7, 9, 10, 11]])